In [1]:
!ls

 AccessingAndModifyingData.ipynb
 archive.zip
 bohubrihipandastutorial__V1.ipynb
 bohubrihipandastutorial__V2.ipynb
 DailyDelhiClimateTest.csv
 DailyDelhiClimateTrain.csv
'Lesson19_ Assignment_(tanviredu2018@gmail.com).ipynb'
'Lesson19_ Assignment_(tanviredu2018@gmail.com).pdf'
 rolling_window.png
 SampleCsv.csv
 studentdata.pickle
 TIME_SERIES_DATA_AND_PLOTTING.ipynb

In [2]:
import numpy  as np
import pandas as pd

In [3]:
df = pd.read_csv("SampleCsv.csv")

In [4]:
df.head()

   Id             Name        City  Grade  Test-Score
0   1         John Doe       Dhaka   85.5          92
1   2       Jane Smith  Chittagong   78.2          88
2   3  Michael Johnson      Khulna   93.0          98
3   4      Emily Davis    Rajshahi   88.7          94
4   5     James Wilson     Barisal   76.4          86

In [6]:
df.set_index('Id',inplace=True)

In [11]:
df = df.head(7)

In [12]:
df.index

Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='Id')

In [13]:
df.columns

Index(['Name', 'City', 'Grade', 'Test-Score'], dtype='object')

In [14]:
df['Name']

Id
1           John Doe
2         Jane Smith
3    Michael Johnson
4        Emily Davis
5       James Wilson
6        Susan Brown
7         Robert Lee
Name: Name, dtype: object

In [15]:
df.loc[1]

Name          John Doe
City             Dhaka
Grade             85.5
Test-Score          92
Name: 1, dtype: object

In [16]:
df.loc[1,"Name"]

'John Doe'

In [17]:
df.loc[1:4,'Name']

Id
1           John Doe
2         Jane Smith
3    Michael Johnson
4        Emily Davis
Name: Name, dtype: object

In [20]:
df.loc[[1,2,3],["Name","City"]]

               Name        City
Id
1          John Doe       Dhaka
2        Jane Smith  Chittagong
3   Michael Johnson      Khulna

In [21]:
df.loc[[1,2,3],:]

               Name        City  Grade  Test-Score
Id
1          John Doe       Dhaka   85.5          92
2        Jane Smith  Chittagong   78.2          88
3   Michael Johnson      Khulna   93.0          98

In [23]:
df.loc[[x for x in df.index if x%3==0],['Name','Grade','Test-Score']]

               Name  Grade  Test-Score
Id
3   Michael Johnson   93.0          98
6       Susan Brown   91.2          97